mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2h1xf/common/s6e2h1xf.h
#define bFM_GPIO_EPFR16_SFMPAC                    *((volatile  uint8_t *)(0x42DEC870UL))
#define bFM4_GPIO_EPFR16_SFMPAC                   *((volatile  uint8_t *)(0x42DEC870UL))
#define bFM_GPIO_EPFR16_SFMPBC                    *((volatile  uint8_t *)(0x42DEC874UL))
#define bFM4_GPIO_EPFR16_SFMPBC                   *((volatile  uint8_t *)(0x42DEC874UL))

#define bFM_GPIO_EPFR20_UESMCKE                   *((volatile  uint8_t *)(0x42DECA00UL))
#define bFM4_GPIO_EPFR20_UESMCKE                  *((volatile  uint8_t *)(0x42DECA00UL))
#define bFM_GPIO_EPFR20_UESMCEE                   *((volatile  uint8_t *)(0x42DECA04UL))
#define bFM4_GPIO_EPFR20_UESMCEE                  *((volatile  uint8_t *)(0x42DECA04UL))
#define bFM_GPIO_EPFR20_UERASE                    *((volatile  uint8_t *)(0x42DECA08UL))
#define bFM4_GPIO_EPFR20_UERASE                   *((volatile  uint8_t *)(0x42DECA08UL))
#define bFM_GPIO_EPFR20_UECASE                    *((volatile  uint8_t *)(0x42DECA0CUL))
#define bFM4_GPIO_EPFR20_UECASE                   *((volatile  uint8_t *)(0x42DECA0CUL))
#define bFM_GPIO_EPFR20_UEDWEXE                   *((volatile  uint8_t *)(0x42DECA10UL))
#define bFM4_GPIO_EPFR20_UEDWEXE                  *((volatile  uint8_t *)(0x42DECA10UL))
#define bFM_GPIO_EPFR20_UECSXE                    *((volatile  uint8_t *)(0x42DECA14UL))
#define bFM4_GPIO_EPFR20_UECSXE                   *((volatile  uint8_t *)(0x42DECA14UL))
#define bFM_GPIO_EPFR20_UEDQM2E                   *((volatile  uint8_t *)(0x42DECA18UL))
#define bFM4_GPIO_EPFR20_UEDQM2E                  *((volatile  uint8_t *)(0x42DECA18UL))
#define bFM_GPIO_EPFR20_UEDQM3E                   *((volatile  uint8_t *)(0x42DECA1CUL))
#define bFM4_GPIO_EPFR20_UEDQM3E                  *((volatile  uint8_t *)(0x42DECA1CUL))
#define bFM_GPIO_EPFR20_UEDTHHB                   *((volatile  uint8_t *)(0x42DECA20UL))
#define bFM4_GPIO_EPFR20_UEDTHHB                  *((volatile  uint8_t *)(0x42DECA20UL))
#define bFM_GPIO_EPFR20_UED16B                    *((volatile  uint8_t *)(0x42DECA24UL))
#define bFM4_GPIO_EPFR20_UED16B                   *((volatile  uint8_t *)(0x42DECA24UL))
#define bFM_GPIO_EPFR20_UED17B                    *((volatile  uint8_t *)(0x42DECA28UL))
#define bFM4_GPIO_EPFR20_UED17B                   *((volatile  uint8_t *)(0x42DECA28UL))
#define bFM_GPIO_EPFR20_UED18B                    *((volatile  uint8_t *)(0x42DECA2CUL))
#define bFM4_GPIO_EPFR20_UED18B                   *((volatile  uint8_t *)(0x42DECA2CUL))
#define bFM_GPIO_EPFR20_UED19B                    *((volatile  uint8_t *)(0x42DECA30UL))
#define bFM4_GPIO_EPFR20_UED19B                   *((volatile  uint8_t *)(0x42DECA30UL))
#define bFM_GPIO_EPFR20_UED20B                    *((volatile  uint8_t *)(0x42DECA34UL))
#define bFM4_GPIO_EPFR20_UED20B                   *((volatile  uint8_t *)(0x42DECA34UL))
#define bFM_GPIO_EPFR20_UED21B                    *((volatile  uint8_t *)(0x42DECA38UL))
#define bFM4_GPIO_EPFR20_UED21B                   *((volatile  uint8_t *)(0x42DECA38UL))
#define bFM_GPIO_EPFR20_UED22B                    *((volatile  uint8_t *)(0x42DECA3CUL))
#define bFM4_GPIO_EPFR20_UED22B                   *((volatile  uint8_t *)(0x42DECA3CUL))
#define bFM_GPIO_EPFR20_UED23B                    *((volatile  uint8_t *)(0x42DECA40UL))
#define bFM4_GPIO_EPFR20_UED23B                   *((volatile  uint8_t *)(0x42DECA40UL))
#define bFM_GPIO_EPFR20_UED24B                    *((volatile  uint8_t *)(0x42DECA44UL))
#define bFM4_GPIO_EPFR20_UED24B                   *((volatile  uint8_t *)(0x42DECA44UL))
#define bFM_GPIO_EPFR20_UED25B                    *((volatile  uint8_t *)(0x42DECA48UL))
#define bFM4_GPIO_EPFR20_UED25B                   *((volatile  uint8_t *)(0x42DECA48UL))
#define bFM_GPIO_EPFR20_UED26B                    *((volatile  uint8_t *)(0x42DECA4CUL))
#define bFM4_GPIO_EPFR20_UED26B                   *((volatile  uint8_t *)(0x42DECA4CUL))
#define bFM_GPIO_EPFR20_UED27B                    *((volatile  uint8_t *)(0x42DECA50UL))
#define bFM4_GPIO_EPFR20_UED27B                   *((volatile  uint8_t *)(0x42DECA50UL))
#define bFM_GPIO_EPFR20_UED28B                    *((volatile  uint8_t *)(0x42DECA54UL))
#define bFM4_GPIO_EPFR20_UED28B                   *((volatile  uint8_t *)(0x42DECA54UL))
#define bFM_GPIO_EPFR20_UED29B                    *((volatile  uint8_t *)(0x42DECA58UL))
#define bFM4_GPIO_EPFR20_UED29B                   *((volatile  uint8_t *)(0x42DECA58UL))
#define bFM_GPIO_EPFR20_UED30B                    *((volatile  uint8_t *)(0x42DECA5CUL))
#define bFM4_GPIO_EPFR20_UED30B                   *((volatile  uint8_t *)(0x42DECA5CUL))
#define bFM_GPIO_EPFR20_UED31B                    *((volatile  uint8_t *)(0x42DECA60UL))
#define bFM4_GPIO_EPFR20_UED31B                   *((volatile  uint8_t *)(0x42DECA60UL))

#define bFM_GPIO_PCR0_P0                          *((volatile  uint8_t *)(0x42DE2000UL))
#define bFM4_GPIO_PCR0_P0                         *((volatile  uint8_t *)(0x42DE2000UL))
#define bFM_GPIO_PCR0_P1                          *((volatile  uint8_t *)(0x42DE2004UL))
#define bFM4_GPIO_PCR0_P1                         *((volatile  uint8_t *)(0x42DE2004UL))
#define bFM_GPIO_PCR0_P2                          *((volatile  uint8_t *)(0x42DE2008UL))
#define bFM4_GPIO_PCR0_P2                         *((volatile  uint8_t *)(0x42DE2008UL))
#define bFM_GPIO_PCR0_P3                          *((volatile  uint8_t *)(0x42DE200CUL))
#define bFM4_GPIO_PCR0_P3                         *((volatile  uint8_t *)(0x42DE200CUL))
#define bFM_GPIO_PCR0_P4                          *((volatile  uint8_t *)(0x42DE2010UL))
#define bFM4_GPIO_PCR0_P4                         *((volatile  uint8_t *)(0x42DE2010UL))
#define bFM_GPIO_PCR0_P5                          *((volatile  uint8_t *)(0x42DE2014UL))
#define bFM4_GPIO_PCR0_P5                         *((volatile  uint8_t *)(0x42DE2014UL))
#define bFM_GPIO_PCR0_P6                          *((volatile  uint8_t *)(0x42DE2018UL))
#define bFM4_GPIO_PCR0_P6                         *((volatile  uint8_t *)(0x42DE2018UL))
#define bFM_GPIO_PCR0_P7                          *((volatile  uint8_t *)(0x42DE201CUL))
#define bFM4_GPIO_PCR0_P7                         *((volatile  uint8_t *)(0x42DE201CUL))
#define bFM_GPIO_PCR0_P8                          *((volatile  uint8_t *)(0x42DE2020UL))
#define bFM4_GPIO_PCR0_P8                         *((volatile  uint8_t *)(0x42DE2020UL))
#define bFM_GPIO_PCR0_P9                          *((volatile  uint8_t *)(0x42DE2024UL))
#define bFM4_GPIO_PCR0_P9                         *((volatile  uint8_t *)(0x42DE2024UL))
#define bFM_GPIO_PCR0_PA                          *((volatile  uint8_t *)(0x42DE2028UL))
#define bFM4_GPIO_PCR0_PA                         *((volatile  uint8_t *)(0x42DE2028UL))
#define bFM_GPIO_PCR0_PB                          *((volatile  uint8_t *)(0x42DE202CUL))
#define bFM4_GPIO_PCR0_PB                         *((volatile  uint8_t *)(0x42DE202CUL))
#define bFM_GPIO_PCR0_PC                          *((volatile  uint8_t *)(0x42DE2030UL))
#define bFM4_GPIO_PCR0_PC                         *((volatile  uint8_t *)(0x42DE2030UL))
#define bFM_GPIO_PCR0_PD                          *((volatile  uint8_t *)(0x42DE2034UL))
#define bFM4_GPIO_PCR0_PD                         *((volatile  uint8_t *)(0x42DE2034UL))
#define bFM_GPIO_PCR0_PE                          *((volatile  uint8_t *)(0x42DE2038UL))
#define bFM4_GPIO_PCR0_PE                         *((volatile  uint8_t *)(0x42DE2038UL))

